IDEA StatiCa Open Model
ConnectionPoint.NodeId Property
Compatible with IDEA StatiCa Beta 21.0 - beta
Note: This API is now obsolete.
 Id of node
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
[ObsoleteAttribute("Use the Node reference element.")]
public int NodeId { get; set; }
<ObsoleteAttribute("Use the Node reference element.")>
Public Property NodeId As Integer
	Get
	Set
public:
[ObsoleteAttribute(L"Use the Node reference element.")]
property int NodeId {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
Remarks
 This property is not longer supported. Use the Node property instead of this one.
See Also
Reference
ConnectionPoint Class
IdeaRS.OpenModel.Connection Namespace